# task number 1

'''Задача №1. По данному целому неотрицательному n вычислите значение n!. 
N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1 
Решить задачу используя цикл while Input: 5 Output: 120'''

'''
print ('Enter your number to count its factorial:')
n = int(input())
if n < 0:
    print ('You entered a negative number')
result = 1
i = 1
while i <= n:
    if n == 0:
        print (result)
    else:
        result = result * i
        i += 1
        print (result)
'''
